<a href="https://colab.research.google.com/github/NarendarB0152/DataScience/blob/main/Pandas/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

In [2]:
lst=[1,2,3,4,5]
pd.Series(lst)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
arr=np.array([1,2,3,4,5])
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
pd.Series(index=["Eshant","rohit","jayesh","ashish"],data=[50,70,50,56])

Eshant    50
rohit     70
jayesh    50
ashish    56
dtype: int64

In [5]:
steps={'day1':4000,'day2':3000,'day3':12000}
pd.Series(steps)

day1     4000
day2     3000
day3    12000
dtype: int64

In [6]:
pd.Series(5).repeat(3)

0    5
0    5
0    5
dtype: int64

In [7]:
pd.Series(5).repeat(3).reset_index(drop=True)

0    5
1    5
2    5
dtype: int64

In [11]:
s=pd.Series([10,20]).repeat([5,2]).reset_index(drop=True)
s

0    10
1    10
2    10
3    10
4    10
5    20
6    20
dtype: int64

In [12]:
s[4]

np.int64(10)

In [13]:
s[2:-2]

2    10
3    10
4    10
dtype: int64

In [14]:
sr=pd.Series([10,20,30,40,50,60,70])
sr.agg([min,max,sum])

/tmp/ipython-input-14-2888059040.py:2: FutureWarning: The provided callable <built-in function min> is currently using Series.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  sr.agg([min,max,sum])
/tmp/ipython-input-14-2888059040.py:2: FutureWarning: The provided callable <built-in function max> is currently using Series.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  sr.agg([min,max,sum])
/tmp/ipython-input-14-2888059040.py:2: FutureWarning: The provided callable <built-in function sum> is currently using Series.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  sr.agg([min,max,sum])

min     10
max     70
sum    280
dtype: int64